



struct XIANTIANGUA 
{
    char NAME[100];
    char GUACI[100];
    char CHUYAO[100];
    char ERYAO[100];
    char SANYAO[100];
    char SIYAO[100];
    char WUYAO[100];
    char SHANGYAO[100];
    char OTHER[100];
}GUA[64] = {
    {"地","元亨，利牝马之贞。君子有攸往，先迷后得,主利。西南得朋，东北丧朋。安贞,吉。","初六：履霜，坚冰至。","六二：直方大，不习无不利。","六三：含章，可贞。或从王事，无成有终。","六四：括囊，无咎无誉。","六五：黄裳，元吉。","上六：龙战于野，其血玄黄。","用六：利永贞。"},
    {"剥","不利。有攸往。","初六：剥床以足，蔑贞凶。","六二：剥床以辨，蔑贞凶。","六三：剥之，无咎。","六四：剥床以肤，凶。","六五：贯鱼，以宫人宠，无不利。","上九：硕果不食，君子得舆，小人剥庐。"},
}